# YOLOv9

# parameters
nc: 1 # number of classes
kpt_shape: [17, 3]
# gelan backbone
backbone:
  - [-1, 1, Silence, []]
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [-1, 1, RepNCSPELAN4_SENetV2, [256, 128, 64, 2]]  # 3
  - [-1, 1, ADown, [256]]  # 4-P3/8
  - [-1, 1, RepNCSPELAN4_SENetV2, [512, 256, 128, 2]]  # 5
  - [-1, 1, ADown, [512]]  # 6-P4/16
  - [ -1, 1, RepNCSPELAN4_SENetV2, [768,512, 256, 2]]  # 7
  - [ -1, 1, ADown, [768]]  # 8-P4/16
  - [-1, 1, RepNCSPELAN4_SENetV2, [1024,768, 512, 2]]  # 9
  - [-1, 1, ADown, [1024]]  # 10-P5/32
  - [-1, 1, RepNCSPELAN4_SENetV2, [1024,768, 512, 2]]  # 11

  - [1, 1, CBLinear, [[64]]] # 12
  - [3, 1, CBLinear, [[64, 128]]] # 13
  - [5, 1, CBLinear, [[64, 128, 256]]] # 14
  - [7, 1, CBLinear, [[64, 128, 256, 512]]] # 15
  - [9, 1, CBLinear, [[64, 128, 256, 512, 768]]] # 16
  - [11, 1, CBLinear, [[64, 128, 256, 512, 768, 1024]]] # 17

  - [0, 1, Conv, [64, 3, 2]]  # 18-P1/2
  - [[12, 13, 14, 15, 16, 17, -1], 1, CBFuse, [[0, 0, 0, 0, 0, 0]]] # 19

  - [-1, 1, Conv, [128, 3, 2]]  # 20-P2/4
  - [[13, 14, 15, 16, 17, -1], 1, CBFuse, [[1, 1, 1, 1, 1]]] # 21

  - [-1, 1, RepNCSPELAN4_SENetV2, [256, 128, 64, 2]]  # 22
  - [-1, 1, ADown, [256]]  # 23-P3/8
  - [[14, 15, 16, 17, -1], 1, CBFuse, [[2, 2, 2, 2]]] # 24

  - [-1, 1, RepNCSPELAN4_SENetV2, [512, 256, 128, 2]]  # 25
  - [-1, 1, ADown, [512]]  # 26-P4/16
  - [[15, 16, 17, -1], 1, CBFuse, [[3, 3, 3]]] # 27

  - [ -1, 1, RepNCSPELAN4_SENetV2, [ 768,512, 256, 2 ] ]  # 28
  - [ -1, 1, ADown, [ 768 ] ]  # 29-P4/16
  - [ [ 16, 17, -1 ], 1, CBFuse, [ [ 4, 4 ] ] ] # 30

  - [-1, 1, RepNCSPELAN4_SENetV2, [1024, 768, 512, 2]]  # 31
  - [-1, 1, ADown, [1024]]  # 32-P5/32
  - [[17, -1], 1, CBFuse, [[5]]] # 33


  - [-1, 1, RepNCSPELAN4_SENetV2, [1024, 768, 512, 2]]  # 34
  - [-1, 1, SPPELAN, [1024, 768]]  # 35
  - [-1, 1, AIFI, []]  # 36

# gelan head
head:
  - [-1, 1, Dy_Sample, []]
  - [[-1, 31], 1, Concat, [1]]  # cat backbone P5
  - [-1, 1, RepNCSPELAN4_SENetV2, [768, 768, 256, 2]]  # 39

  - [-1, 1, Dy_Sample, []]
  - [[-1, 28], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, RepNCSPELAN4_SENetV2, [512, 512, 256, 2]]  # 42

  - [-1, 1, Dy_Sample, []]
  - [[-1, 25], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, RepNCSPELAN4_SENetV2, [256, 256, 128, 2]]  # 45 (P3/8-small)
  - [-1, 1, MultiSEAM, []]  # 46

  - [-1, 1, ADown, [256]]
  - [[-1, 42], 1, Concat, [1]]  # cat head P4
  - [-1, 1, RepNCSPELAN4_SENetV2, [512, 512, 256, 2]]  # 49 (P4/16-medium)
  - [-1, 1, MultiSEAM, []]  # 50

  - [-1, 1, ADown, [256]]
  - [[-1, 39], 1, Concat, [1]]  # cat head P5
  - [-1, 1, RepNCSPELAN4_SENetV2, [768, 768, 512, 2]]  # 53 (P4/16-medium)
  - [-1, 1, MultiSEAM, []]  # 54

  - [-1, 1, ADown, [512]]
  - [[-1, 36], 1, Concat, [1]]  # cat head P6
  - [-1, 1, RepNCSPELAN4_SENetV2, [1024, 1024, 768, 2]]  # 57 (P5/32-large)
  - [-1, 1, MultiSEAM, []]  # 58
   # detect
  - [[46, 50, 54, 58], 1, RepPose, [nc, kpt_shape]]  # Detect(P3, P4, P5)
